# Excercise 1
# Prakruthi B Gopal
# 21BDA25

PYTHON BASICS

In [1]:
#Python can handle integer data types
67

67

In [2]:
#python van handle float data types
36.926

36.926

In [3]:
#python can handle strings
"Machine learning"

'Machine learning'

In [ ]:
" "
#an ampty string

In [5]:
#python can handle boolean values
True

True

In [6]:
False

False

In [7]:
#A list in Python is used to store the sequence of various types of data,python lists are mutable
x=['a',78,True,45.28,'b']

In [8]:
#nested list
[x,x]

[['a', 78, True, 45.28, 'b'], ['a', 78, True, 45.28, 'b']]

In [9]:
#operators

In [10]:
78+89.3456

167.3456

In [11]:
45-892.109346

-847.109346

In [12]:
"78"+"678"
#string concatenation

'78678'

In [13]:
10937*890416.9090

9738489733.733

In [14]:
9/3

3.0

In [15]:
9//3

3

In [16]:
type(89)

int

In [17]:
type("prakruthi")

str

In [18]:
type(67.178) #data type can be found by type()

float

In [19]:
#assigning a variable
x=25

In [20]:
x==89
#to check if x is equal to 89

False

In [21]:
#A tuple is a collection of objects which are ordered and immutable,tuples are sequences just like lists. The differences between tuples and lists are, that tuples cannot be changed unlike lists and tuples use parentheses, whereas lists use square brackets.
tup1=(89,56,'apple')
tup1

(89, 56, 'apple')

In [22]:
type(tup1)

tuple

In [24]:
#elements present in the list can be retrieved by slicing
list1=[2,4,6,8,10]
list1[2]

6

In [25]:
list1[1:4]

[4, 6, 8]

In [28]:
#range function
range(60)

range(0, 60)

In [36]:
y=range(30,60,5)
for i in y:
    print(i)

30
35
40
45
50
55

In [29]:
#for loop
for i in range(1,16):
    print(i)

1
2
3
4
5
6
7
8
9
10
11
12
13
14
15

In [33]:
#conditional statement
tips=[26.90,67.19,45,12,65.57,100]
for tip in tips:
    print(tip)
    if tip>=66:
        print("high tip")
    elif tip>=30:
        print("not bad")
    else:
        print("low")
    print("**********************************")

26.9
low
**********************************
67.19
high tip
**********************************
45
not bad
**********************************
12
low
**********************************
65.57
not bad
**********************************
100
high tip
**********************************

In [37]:
#functions
def greet():
    print("Hello,this is SJC")

In [38]:
greet()
#function calling

Hello,this is SJC

In [45]:
def mult(x=10,y=12):
    return x*y

In [46]:
#multiplies the numbers provided as asrguments of the function
mult(90,90)

8100

In [47]:
#uses the default arguments provide during function definition
mult()

120

In [48]:
#one argument provide during the function call and the other default argument provided during function definiton are multiplied 
mult(30)

360

PYTHON FOR DATA SCIENCE

In [49]:
import numpy as np
import pandas as pd

In [52]:
#creating a pandas series
salary=pd.Series([500,400,650,290,380,610])

In [68]:
salary

0    500
1    400
2    650
3    290
4    380
5    610
6    435
dtype: int64

In [69]:
salary.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

In [70]:
salary.values

array([500, 400, 650, 290, 380, 610, 435], dtype=int64)

In [71]:
salary[2:5]

2    650
3    290
4    380
dtype: int64

In [72]:
salary[6]=435

In [73]:
salary

0    500
1    400
2    650
3    290
4    380
5    610
6    435
dtype: int64

In [74]:
salary.value_counts()

400    1
290    1
435    1
500    1
610    1
650    1
380    1
dtype: int64

In [81]:
#creating a pandas data frame
sample_df=pd.DataFrame([["a","b","c","d","e","f","g"],salary]).T

In [82]:
sample_df

   0    1
0  a  500
1  b  400
2  c  650
3  d  290
4  e  380
5  f  610
6  g  435

In [83]:
sample_df.columns=["id","salary"]

In [84]:
sample_df

  id salary
0  a    500
1  b    400
2  c    650
3  d    290
4  e    380
5  f    610
6  g    435

In [86]:
#raeding a csv file
df=pd.read_csv("C:/Users/91866/Downloads/tips.csv")

In [88]:
df.head()

   table_number  total_bill   tip     sex smoker  day    time  size
0             3       16.99  1.01  Female     No  Sun  Dinner     2
1             6       10.34  1.66    Male     No  Sun  Dinner     3
2            16       21.01  3.50    Male     No  Sun  Dinner     3
3            12       23.68  3.31    Male     No  Sun  Dinner     2
4             2       24.59  3.61  Female     No  Sun  Dinner     4

In [89]:
df.tail()

     table_number  total_bill   tip     sex smoker   day    time  size
239             9       29.03  5.92    Male     No   Sat  Dinner     3
240             4       27.18  2.00  Female    Yes   Sat  Dinner     2
241             5       22.67  2.00    Male    Yes   Sat  Dinner     2
242             4       17.82  1.75    Male     No   Sat  Dinner     2
243             1       18.78  3.00  Female     No  Thur  Dinner     2

In [90]:
df[['total_bill','tip']]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

In [91]:
type(df['tip'])

pandas.core.series.Series

In [92]:
type(df)

pandas.core.frame.DataFrame

In [93]:
df['sex'].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [94]:
df.shape

(244, 8)

In [98]:
#to detect missing values and return the sum
df.isna().sum()

table_number    0
total_bill      0
tip             0
sex             0
smoker          0
day             0
time            0
size            0
dtype: int64

In [100]:
df.columns

Index(['table_number', 'total_bill', 'tip', 'sex', 'smoker', 'day', 'time',
       'size'],
      dtype='object')

In [105]:
#dictionaries
dict1={'colour':['red','blue','black','white','green'],'num':[100,290,180,140,300]}

In [106]:
df2=pd.DataFrame(dict1)

In [107]:
df2

  colour  num
0    red  100
1   blue  290
2  black  180
3  white  140
4  green  300

In [108]:
df2['num']>200

0    False
1     True
2    False
3    False
4     True
Name: num, dtype: bool

In [109]:
df[(df['total_bill']>20)&(df['tip']>3)]

     table_number  total_bill   tip     sex smoker  day    time  size
2              16       21.01  3.50    Male     No  Sun  Dinner     3
3              12       23.68  3.31    Male     No  Sun  Dinner     2
4               2       24.59  3.61  Female     No  Sun  Dinner     4
5               3       25.29  4.71    Male     No  Sun  Dinner     4
7              14       26.88  3.12    Male     No  Sun  Dinner     4
..            ...         ...   ...     ...    ...  ...     ...   ...
212             4       48.33  9.00    Male     No  Sat  Dinner     4
214             6       28.17  6.50  Female    Yes  Sat  Dinner     3
219             6       30.14  3.09  Female    Yes  Sat  Dinner     4
238             2       35.83  4.67  Female     No  Sat  Dinner     3
239             9       29.03  5.92    Male     No  Sat  Dinner     3

[67 rows x 8 columns]

In [111]:
#correlation between variables of the dataset
df.corr()

              table_number  total_bill       tip      size
table_number      1.000000   -0.042828 -0.091144  0.005621
total_bill       -0.042828    1.000000  0.675734  0.598315
tip              -0.091144    0.675734  1.000000  0.489299
size              0.005621    0.598315  0.489299  1.000000

In [116]:
#descriptive statistics of the dataset
df.describe()

       table_number  total_bill         tip        size
count    244.000000  244.000000  244.000000  244.000000
mean       8.561475   19.785943    2.998279    2.569672
std        4.583957    8.902412    1.383638    0.951100
min        1.000000    3.070000    1.000000    1.000000
25%        4.000000   13.347500    2.000000    2.000000
50%        9.000000   17.795000    2.900000    2.000000
75%       12.000000   24.127500    3.562500    3.000000
max       16.000000   50.810000   10.000000    6.000000